benchmarks/parasiticRipples/N100/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( );

initializationName  init;

initCoeffs
{
    waveType            stokesFifth;
    height              0.0039788736;
    period              0.17348915;
    depth               1;
    stokesDrift         0;
    direction           ( 1 0 0 );
    Tsoft               0;
    phi                 3.1415927;
    waveNumber          (125.6637 0 0);
    omega               36.216589;
}



// ************************************************************************* //
