benchmarks/parasiticRipples/N100/system/ijkDict
{
cellSet refinedCells;
cyclicX true;
}
