benchmarks/parasiticRipples/N100/system/setAlphaFieldDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field           "alpha1";

type            randomWaveField;

amplitude       1;

waterLevel      0;

interfaceTol    1e-08;

nRows           3;

height          0.125;

N               32;

waveNumber     (1.63482 0 0);

A              nonuniform List<scalar>
32
(
 0.056842221161963
 0.017959530712861
 0.0051100549295947
 0.0015164421771204
 0.00048164752082798
 0.00016217137054844
 5.7022975006423e-05
 2.0696590450325e-05
...
 );


// ************************************************************************* //
